nav.title = \uC790\uBC14 \uB85C\uB4DC\uB9F5
nav.guide = \uC0AC\uC6A9\uBC95

title.name = \uC790\uBC14 \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790

sub-title.name = \uC790\uBC14 \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD55C \uC5EC\uC815 

download = PDF \uD30C\uC77C \uB2E4\uC6B4\uB85C\uB4DC

language = \uC5B8\uC5B4
language.ko= \uD55C\uAD6D\uC5B4
language.en = \uC601\uC5B4

subject.must-have = \uD544\uC218
subject.important = \uC911\uC694
subject.cs = \uCEF4\uD4E8\uD130 \uACFC\uD559
subject.better = \uB354 \uB098\uC740 \uAC1C\uBC1C\uC744 \uC704\uD574

modal.status = \uC644\uB8CC

button.must-have.html = HTML & CSS
button.must-have.java = \uC790\uBC14
button.must-have.mysql = MySQL
button.must-have.spring = \uC2A4\uD504\uB9C1 \uD504\uB808\uC784\uC6CC\uD06C
button.must-have.jpa = JPA
button.must-have.spring.security = \uC2A4\uD504\uB9C1 \uC2DC\uD050\uB9AC\uD2F0
button.must-have.spring.test = \uC2A4\uD504\uB9C1 \uD14C\uC2A4\uD2B8
button.must-have.spring.microservice = \uC2A4\uD504\uB9C1 \uB9C8\uC774\uD06C\uB85C\uC11C\uBE44\uC2A4

button.important.overview = \uD504\uB85C\uADF8\uB798\uBC0D \uAC1C\uC694
button.important.git = Git
button.important.aws = AWS(\uC544\uB9C8\uC874 \uC6F9 \uC11C\uBE44\uC2A4)
button.important.linux = \uB9AC\uB205\uC2A4
button.important.docker = \uB3C4\uCEE4
button.important.kubernetes = \uCFE0\uBC84\uB124\uD2F0\uC2A4

button.cs.crash = \uAE30\uCD08 IT \uC9C0\uC2DD
button.cs.cs50 = CS50
button.cs.dsa = \uC790\uB8CC\uAD6C\uC870 & \uC54C\uACE0\uB9AC\uC998
button.cs.ca = \uCEF4\uD4E8\uD130 \uAD6C\uC870
button.cs.os = \uC6B4\uC601\uCCB4\uC81C
button.cs.db = \uB370\uC774\uD130\uBCA0\uC774\uC2A4
button.cs.net = \uB124\uD2B8\uC6CC\uD06C
button.cs.interview = \uC778\uD130\uBDF0 \uC900\uBE44

button.better.oop = \uAC1D\uCCB4\uC9C0\uD5A5 \uD504\uB85C\uADF8\uB798\uBC0D
button.better.clean-code = \uD074\uB9B0 \uCF54\uB4DC
button.better.design-pattern = \uB514\uC790\uC778 \uD328\uD134
button.better.refactoring = \uB9AC\uD329\uD1A0\uB9C1
button.better.system-design = \uC2DC\uC2A4\uD15C \uB514\uC790\uC778
button.better.tdd = \uD14C\uC2A4\uD2B8 \uC8FC\uB3C4 \uAC1C\uBC1C
button.better.microservice = \uB9C8\uC774\uD06C\uB85C\uC11C\uBE44\uC2A4

introduction = \uC800\uB294 \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790\uB85C\uC11C, \uC790\uBC14\uC640 \uC2A4\uD504\uB9C1 \uBD80\uD2B8\uB97C \uD604\uC7AC \uC5F4\uC2EC\uD788 \uACF5\uBD80\uD558\uACE0 \uC788\uB294 \uD559\uC0DD\uC785\uB2C8\uB2E4!

guide.title = \uC0AC\uC6A9\uBC95

guide.why.title = \uC774 \uC0AC\uC774\uD2B8\uB294 \uC65C \uB9CC\uB4E4\uC5B4\uC84C\uB098\uC694?
guide.why.text.first = \uC800\uB294 6\uAC1C\uC6D4 \uC804\uC5D0 Java \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD55C \uC5EC\uC815\uC744 \uC2DC\uC791\uD588\uC2B5\uB2C8\uB2E4. \uADF8 \uB54C \uC81C\uAC00 \uC54C\uAC8C \uB41C \uAC83\uC740 JavaScript \uAC19\uC740 \uD504\uB860\uD2B8\uC5D4\uB4DC\uC5D0 \uB300\uD55C \uB85C\uB4DC\uB9F5\uC774 \uB9CE\uC774 \uC788\uC9C0\uB9CC, Java \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD55C \uB85C\uB4DC\uB9F5\uC740 \uADF8\uB2E4\uC9C0 \uB9CE\uC9C0 \uC54A\uC558\uB2E4\uB294 \uAC83\uC774\uC5C8\uC2B5\uB2C8\uB2E4. \uC774\uB85C \uC778\uD574 \uCC98\uC74C\uC5D0 \uC5B4\uB5BB\uAC8C \uC790\uBC14\uB97C \uACF5\uBD80\uD574\uC57C\uD560 \uC9C0 \uB9E4\uC6B0 \uD63C\uB780\uC2A4\uB7EC\uC6E0\uC2B5\uB2C8\uB2E4.
guide.why.text.second = \uC800\uB294 \uC544\uC9C1 Java\uB97C \uACF5\uBD80\uD55C \uC9C0 \uBC18\uB144\uC774 \uC9C0\uB098\uACE0 \uC788\uACE0 \uC5EC\uC804\uD788 \uACF5\uBD80\uC911\uC774\uC9C0\uB9CC, \uC774 \uC6F9\uC0AC\uC774\uD2B8\uB97C \uB9CC\uB4E4\uAE30\uB85C \uACB0\uC815\uD588\uC2B5\uB2C8\uB2E4. \uC774 \uC0AC\uC774\uD2B8\uB294 \uC81C\uAC00 \uACF5\uBD80\uD55C \uAC83\uB4E4, \uACF5\uBD80\uD560 \uAC83\uB4E4 \uC815\uB9AC\uD55C \uAC83\uC744 \uB530\uB974\uACE0 \uC788\uB294 \uB85C\uB4DC\uB9F5\uC744 \uBC18\uC601\uD55C \uAC83\uC785\uB2C8\uB2E4.\uC790\uBC14 \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD55C \uBAA8\uB4E0 \uAC83\uC744 \uD3EC\uD568\uD558\uACE0 \uC788\uC9C0\uB294 \uC54A\uC9C0\uB9CC, \uBE44\uC2B7\uD55C \uCC98\uC9C0\uC5D0 \uC788\uB294 \uB2E4\uB978 \uC0AC\uB78C\uB4E4\uC5D0\uAC8C \uB3C4\uC6C0\uC774 \uB420 \uC218 \uC788\uAE30\uB97C \uBC14\uB78D\uB2C8\uB2E4.
guide.why.text.third = \uC800\uB3C4 \uC544\uC9C1 \uB9E4\uC6B0 \uBD80\uC871\uD558\uAE30 \uB54C\uBB38\uC5D0, \uB9CC\uC57D \uC624\uB958\uB97C \uBC1C\uACAC\uD558\uAC70\uB098 \uC774 \uB85C\uB4DC\uB9F5\uC744 \uAC1C\uC120\uD560 \uC81C\uC548\uC774 \uC788\uB2E4\uBA74,\uC544\uB798 \uB9C1\uD06C\uC5D0 \uC788\uB294 \uC800\uC5D0\uAC8C \uC5F0\uB77D\uD574 \uC8FC\uC138\uC694!

guide.usage.title = \uC774 \uB85C\uB4DC\uB9F5 \uC0AC\uC6A9\uBC95
guide.usage.text.first = "\uD544\uC218" \uC139\uC158\uC740 Java \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD55C \uD544\uC218\uC801\uC778 \uC9C0\uC2DD\uC744 \uB098\uD0C0\uB0C5\uB2C8\uB2E4. \uC774\uAC83\uB4E4\uC740 \uC790\uBC14 \uBC31\uC5D4\uB4DC \uAC1C\uBC1C\uC790\uAC00 \uB418\uAE30 \uC704\uD574\uC11C \uBC18\uB4DC\uC2DC \uBC30\uC6CC\uC57C \uD558\uB294 \uAE30\uBCF8\uC801\uC778 \uC8FC\uC81C\uB4E4\uC785\uB2C8\uB2E4.
guide.usage.text.second = "\uC911\uC694" \uC139\uC158\uC5D0\uB294 \uBC30\uC6B0\uB294 \uAC83\uC774 \uC911\uC694\uD55C \uC8FC\uC81C\uB4E4\uC774 \uD3EC\uD568\uB418\uC5B4 \uC788\uC9C0\uB9CC, \uD544\uC694\uD560 \uB54C \uD559\uC2B5\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uB2F9\uC7A5 \uC774 \uC8FC\uC81C\uB4E4\uC744 \uAE4A\uAC8C \uACF5\uBD80\uD560 \uD544\uC694\uB294 \uC5C6\uC9C0\uB9CC, \uACB0\uAD6D \uC774\uB4E4\uC744 \uCEE4\uBC84\uD558\uB294 \uAC83\uC774 \uAD8C\uC7A5\uB429\uB2C8\uB2E4.
guide.usage.text.third = "\uCEF4\uD4E8\uD130 \uACFC\uD559" \uC139\uC158\uC740 \uCEF4\uD4E8\uD130 \uACFC\uD559 \uC6D0\uB9AC\uC5D0 \uB300\uD55C \uAC15\uB825\uD55C \uAE30\uBC18\uC744 \uC81C\uACF5\uD569\uB2C8\uB2E4. \uC774\uB7EC\uD55C \uAC1C\uB150\uB4E4\uC744 \uC774\uD574\uD558\uBA74 \uD504\uB85C\uADF8\uB798\uBC0D\uC5D0 \uB300\uD55C \uC774\uD574\uB97C \uD06C\uAC8C \uD5A5\uC0C1\uC2DC\uD0AC \uC218 \uC788\uC2B5\uB2C8\uB2E4.
guide.usage.text.fourth = "\uB354 \uB098\uC744 \uAC1C\uBC1C\uC744 \uC704\uD574" \uC139\uC158\uC740 \uCF54\uB4DC\uC758 \uD488\uC9C8\uACFC \uC720\uC9C0 \uAD00\uB9AC\uC131\uC744 \uD5A5\uC0C1\uC2DC\uD0A4\uB294 \uAE30\uBC95\uACFC \uC2E4\uCC9C \uC0AC\uB840\uB97C \uC81C\uACF5\uD569\uB2C8\uB2E4. \uC774\uB7EC\uD55C \uAC00\uC774\uB4DC\uB77C\uC778\uC740 \uB354 \uAE54\uB054\uD558\uACE0 \uD6A8\uC728\uC801\uC778 \uCF54\uB4DC\uB97C \uC791\uC131\uD558\uB294 \uB370 \uAE30\uC5EC\uD569\uB2C8\uB2E4.

